import sys
import os

# Add the project root to the Python path
sys.path.insert(0, os.path.abspath(os.path.join(os.path.dirname(__file__), '../../')))

import ollama
import json

from src.utils.prompt import SYSTEM_PROMPT

class EventExtractor:
    def __init__(self, model_name="qwen2.5:3b"):
        self.model = model_name

    def process_post(self, text):
        response = ollama.chat(
            model=self.model,
            messages=[
                {"role": "system", "content": SYSTEM_PROMPT},
                {"role": "user", "content": f"Текст поста:\n{text}"},
            ],
            format="json",
        )

        return json.loads(response["message"]["content"])


example_post = """\
#Культура
Московская музейная неделя в музее-заповеднике «Коломенское»
📅 13.02.2026
📍 музей-заповедник «Коломенское»

В пятницу, 13 февраля, в рамках Московской музейной недели можно бесплатно посетить музей-заповедник «Коломенское». Вас ждут 8 временных и 7 постоянных экспозиций, а также экскурсии по территории и внутри музея-заповедника.

Друзья, ждём вас сегодня в 19:00 на нашу философскую встречу. Как обычно, будем совместно читать текст и обсуждать прочитанное. 

В честь наступающего 14 февраля — тема вечера Эрих Фромм и избранные главы из его работы «Искусство любить». 

Мы ждём всех, независимо от уровня вашей подготовки. Текст подойдет как тем, кто встречался с философией лишь в вузе, так и тем, кто уже читал большое количество работ. 

Посещение — по тарифу Циферблата без доплат.
Если у вас остались вопросы, пишите в комментарии или напрямую @Lettushka
"""
print(EventExtractor(model_name="qwen2.5:1.5b").process_post(example_post))
